api/test/staging_tests/jmeter.yml
execution:
- concurracy: 10
  ramp-up: 10s
  hold-for: 20s
  scenario: getExam
- concurracy: 10
  ramp-up: 10s
  hold-for: 20s
  scenario: bookExam

scenarios:
  getExam:
    requests:
     - url: http://web:8080/exam
       method: GET
       label: getExam
  bookExam:
    requests:
     - url: http://web:8080/exam/create
       method: POST
       label: bookExam
       headers:
         Content-Type: application/json
       body:
         text: {"date": "2017-12-30", "name": "exam", "duration": 30, "timeSlots": 20}
       assert:
        - contains:
          - .+b.+
  

modules:
  jmeter:
    path: ~/.bzt/jmeter-taurus/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-3.3.zip
    version: 3.3  # minimal supported version of JMeter is 2.9
    force-ctg: true   # true by default
    detect-plugins: true
    plugins:
    - jpgc-json=2.2
    - jpgc-casutg

reporting:
  - module: junit-xml
    filename: junit_staging_dump.xml