api/test/staging_tests/jmeter.yml
execution:
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: registerUser
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: getExam
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: createExam
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: reportExam
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: listExam
- concurracy: 1
  ramp-up: 10s
  hold-for: 20s
  scenario: bookExam

scenarios:
  registerUser:
    requests:
     - url: http://web:8080/user/register
       method: POST
       label: registerUser
       headers:
        Content-Type: application/x-www-form-urlencoded
       body:
         text: '{"lnu": "tk222hq", "github": "tommykronstal"}'
         user_name: 'tommykronstal'
  getExam:
    requests:
     - url: http://web:8080/exam
       method: GET
       label: getExam
  createExam:
    requests:
     - url: http://web:8080/exam/create
       method: POST
       label: createExam
       headers:
         Content-Type: application/x-www-form-urlencoded
       body:
         text: '{"date": "2018-12-30", "name": "exam", "duration": 30, "timeSlots": 20, "examiners":2}'
         channel_name: "1dv021"
       assert:
        - contains:
          - .+course.+
          - .+name.+
  listExam:
    requests:
     - url: http://web:8080/exam/get
       method: POST
       label: listExam
       headers:
        Content-Type: application/x-www-form-urlencoded
       body:
         channel_name: "1dv021"
  reportExam:
    requests:
     - url: http://web:8080/reportexam
       method: POST
       label: reportExam
       headers:
        Content-Type: application/x-www-form-urlencoded
       body: 'buildOk=true&studentId=tk222hq&course=1dv021&exam=exam'
  bookExam:
    requests:
     - url: http://web:8080/bookexam
       method: POST
       label: bookExam
       headers:
        Content-Type: application/x-www-form-urlencoded
       body:
         payload: '{"channel": {"name": "1dv021"}, "user": {"name": "tk222hq"}, "actions":[{"value": "exam*1"}]}'


modules:
  jmeter:
    path: ~/.bzt/jmeter-taurus/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-3.3.zip
    version: 3.3  # minimal supported version of JMeter is 2.9
    force-ctg: true   # true by default
    detect-plugins: true
    plugins:
    - jpgc-json=2.2
    - jpgc-casutg

reporting:
  - module: junit-xml
    filename: junit_staging_dump.xml